app/views/subcategories/leader.html.erb

        <% @leaderboard.each do |f| %>
            <% @user=User.find(f.user_id)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]