app/views/users/view.html.erb

SELECT COUNT(*) FROM "questions" WHERE "questions"."quiz_id" = ?  [["quiz_id", 6]]
SELECT COUNT(*) FROM "states" WHERE "states"."user_id" = ? AND "states"."quiz_id" = ?  [["user_id", 101], ["quiz_id", 6]]
---

        <% cnt=Question.where(quiz_id: f.quiz_id).count%>
        <% if State.where(user_id: @current_user.id,quiz_id: @quiz.id).count==0 %>