app/controllers/categories_controller.rb

  def index
    @categories = Category.paginate(page: params[:page])
---
SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"

  def show
    @category = Category.find(params[:id])
    @subcategories = Subcategory.where(category_id: params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = ? LIMIT ?  [["category_id", 1], ["LIMIT", 1]]

  def destroy
    current_user
    if @current_user.admin
      Category.find(params[:id]).destroy
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 12]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def leaderboard
    @category=Category.find(params[:id])
    @temp=Lecategory.where(category_id: params[:id])
    @leaderboard=@temp.order(actscore: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "lecategories".* FROM "lecategories" WHERE "lecategories"."category_id" = ? ORDER BY "lecategories"."actscore" DESC  [["category_id", 11]]