app/controllers/games_controller.rb

  def play
    current_user
    if @current_user==nil
      flash[:success] = "Please Login to play the quiz"
      redirect_to login_path and return
    end
    puts("in play")
    @game1=Score.where(quiz_id: params[:id] ,user_id: @current_user.id).first

    #if already there
    if @game1
      @newquestion=State.where(quiz_id: params[:id]).first
      @score1=@game1.actscore
        if @newquestion
            @question=Question.find(@newquestion.question_id)
        else
          puts("in else of if")
          flash[:success] = "Quiz completed"
          @score1=@game1.actscore
          render 'show' and return
          #redirect_to @current_user and return
        end
    #if not there add all the question of this quiz to state table
    else
      @questions=Question.where(quiz_id: params[:id])
      #Score.new(quiz_id: params[:id] ,user_id: @current_user.id ,score: 0).save

      @questions.each do |f|
        @newstate=State.new(user_id: @current_user.id,quiz_id: params[:id],question_id: f.id)
        @newstate.save
---
SELECT  "scores".* FROM "scores" WHERE "scores"."quiz_id" = ? AND "scores"."user_id" = ? ORDER BY "scores"."id" ASC LIMIT ?  [["quiz_id", 6], ["user_id", 101], ["LIMIT", 1]]
SELECT  "states".* FROM "states" WHERE "states"."quiz_id" = ? ORDER BY "states"."id" ASC LIMIT ?  [["quiz_id", 5], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."quiz_id" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["quiz_id", 5], ["LIMIT", 1]]
INSERT INTO "states" ("user_id", "quiz_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 101], ["quiz_id", 5], ["question_id", 1], ["created_at", "2017-09-16 16:29:49.132890"], ["updated_at", "2017-09-16 16:29:49.132890"]]

  def update
    current_user
    @game=Score.where(quiz_id: params[:id] ,user_id: @current_user.id).first
    @quiz=Quiz.find(params[:id])

    temp=""
    if params[:one]
      temp=temp+'A'
    end
    if params[:two]
      temp=temp+'B'
    end
    if params[:three]
      temp=temp+'C'
    end
    if params[:four]
      temp=temp+'D'
    end

    # if games exists
     if @game
       puts("In if")

       answer=Question.find(params[:question_id]).answer

        if temp==answer
         tempscore=@game.actscore+10
         @game.update_attribute(:actscore, tempscore)
         @sub=Subcategory.find(@quiz.subcategory_id)
         @lecat=Lecategory.where(category_id: @sub.category_id ,user_id: @current_user.id ).first
         @lesubcat=Lesubcategory.where(subcategory_id: @quiz.subcategory_id,user_id: @current_user.id ).first
---
SELECT  "scores".* FROM "scores" WHERE "scores"."quiz_id" = ? AND "scores"."user_id" = ? ORDER BY "scores"."id" ASC LIMIT ?  [["quiz_id", 6], ["user_id", 101], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "scores" SET "updated_at" = ?, "actscore" = ? WHERE "scores"."id" = ?  [["updated_at", "2017-09-16 17:19:03.582356"], ["actscore", 10], ["id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "lecategories".* FROM "lecategories" WHERE "lecategories"."category_id" = ? AND "lecategories"."user_id" = ? ORDER BY "lecategories"."id" ASC LIMIT ?  [["category_id", 11], ["user_id", 101], ["LIMIT", 1]]
SELECT  "lesubcategories".* FROM "lesubcategories" WHERE "lesubcategories"."subcategory_id" = ? AND "lesubcategories"."user_id" = ? ORDER BY "lesubcategories"."id" ASC LIMIT ?  [["subcategory_id", 13], ["user_id", 101], ["LIMIT", 1]]

        end

       @state=State.where(user_id: @current_user.id , question_id:params[:question_id])
       State.delete(@state)
     else
       puts("In else")
       @score=Score.new(quiz_id: params[:id] ,user_id: @current_user.id ,actscore: 0)
       @score.save
---
DELETE FROM "states" WHERE "states"."id" IN (SELECT "states"."id" FROM "states" WHERE "states"."user_id" = ? AND "states"."question_id" = ?)  [["user_id", 101], ["question_id", 1]]
INSERT INTO "scores" ("user_id", "quiz_id", "created_at", "updated_at", "actscore") VALUES (?, ?, ?, ?, ?)  [["user_id", 101], ["quiz_id", 6], ["created_at", "2017-09-16 17:19:03.434942"], ["updated_at", "2017-09-16 17:19:03.434942"], ["actscore", 0]]