app/controllers/questions_controller.rb

INSERT INTO "questions" ("quiz_id", "content", "option_a", "option_b", "option_c", "option_d", "answer", "q_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @question = Question.new(content: params[:question][:content],q_type: "string", quiz_id: params[:question][:quiz_id],option_a: params[:question][:option_a],option_b: params[:question][:option_b],option_c: params[:question][:option_c],option_d: params[:question][:option_d],answer: params[:question][:answer])

    @quiz=Quiz.find_by(id: params[:question][:quiz_id])

    if @question.save