app/controllers/quizzes_controller.rb

SELECT "categories".* FROM "categories"
SELECT "subcategories".* FROM "subcategories"
---
  def new
    current_user
    if @current_user.admin
      puts("Rendering new")
      @quiz = Quiz.new
      @categories=Category.where(name="")
      @subcategories=Subcategory.where(name="")
      @cat_array=[]
      @sub_array=[]
      @categories.each do |f|
        @cat_array.append([f.name,f.id])
      end
      @subcategories.each do |g|

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def create

    @subcategory=Subcategory.find(params[:quiz][:subcategory_id])

SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  [["quiz_id", 5]]
---
  def show
    @quiz = Quiz.find(params[:id])
    @questions = Question.where(quiz_id: params[:id])

SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  [["quiz_id", 4]]
---
  def play
    @quiz = Quiz.find(params[:id])
    @questions = Question.where(quiz_id: params[:id])