app/controllers/subcategories_controller.rb

SELECT  "subcategories".* FROM "subcategories" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "subcategories"
---
  def index
    @subcategories = Subcategory.paginate(page: params[:page])

SELECT "categories".* FROM "categories"
---
  def new
    current_user
    if @current_user.admin
        @subcategory = Subcategory.new
        @categories=Category.where(name="")
        @array=[]
        @categories.each do |f|

DELETE FROM "subcategories" WHERE "subcategories"."id" = ?  [["id", 2]]
SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def destroy
    current_user
    if @current_user.admin
      Subcategory.find(params[:id]).destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "subcategories" ("name", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hi"], ["category_id", 1], ["created_at", "2017-09-14 19:10:43.913233"], ["updated_at", "2017-09-14 19:10:43.913233"]]
---
  def create

    @subcategory = Subcategory.new(name: params[:subcategory][:name],category_id: params[:subcategory][:category_id])
    @category=Category.find_by(id: params[:subcategory][:category_id])

    if @subcategory.save

SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @subcategory = Subcategory.find(params[:id])

SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "lesubcategories".* FROM "lesubcategories" WHERE "lesubcategories"."subcategory_id" = ? ORDER BY "lesubcategories"."actscore" DESC  [["subcategory_id", 13]]
---
  def leaderboard
    @subcategory=Subcategory.find(params[:id])
    @temp=Lesubcategory.where(subcategory_id: params[:id])
    @leaderboard=@temp.order(actscore: :desc)