app/controllers/users_controller.rb

  def destroy
    current_user
    if @current_user.admin
        User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 102]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]

  def view
    @state=Score.where(user_id: params[:id])
---
SELECT "scores".* FROM "scores" WHERE "scores"."user_id" = ?  [["user_id", 1]]