app/views/categories/leader.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
---
          <% @leaderboard.each do |f| %>
          <% @user=User.find(f.user_id)%>